//Учитывая строку, ваша задача состоит в том, чтобы переупорядочить свои буквы таким образом, чтобы она стала палиндром (то есть она читает те же форварды и назад).
//        Вход
//        Единственная входная линия имеет цепь длины n, состоящую из символов a - z.
//        Выход
//        Распечатайте палиндром, состоящий из символов оригинальной строки. Вы можете распечатать любое действительное решение. Если нет решений, распечатайте «Нет решения».
//        Ограничения
//
//        1 <= n <= 10^6
//
//        Пример
//        Вход:
//        AAAACACBA
//
//        Выход:
//        AACABACAA

        package Task4;

import java.util.HashMap;

public class Task4 {
        public static void main(String[] args) {
                HashMap hm = new HashMap();
                String input = "AAAACACBA";

        }

}

